notes-server/soap-examples/get-all.txt

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope
xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
soap:encodingStyle="http://www.w3.org/2003/05/soap-encoding">
  <soap:Body>
    <m:GetAllNotes xmlns:m="https://notes-server/soap/v1">
    </m:GetAllNotes>
  </soap:Body>
</soap:Envelope>